In [1]:
import numpy as np
import pandas as pd

#### Question 1

Desired

```
  a                b
  
 val 1 | val 2 | val 1 | val 2
 
  1    |   2   |  4    |   4

```

In [2]:
df = pd.DataFrame({'name':['a','b'], 'val_1':[1,4],'val_2':[2,4]})
df

  name  val_1  val_2
0    a      1      2
1    b      4      4

In [21]:
# This does not work
df.pivot(index=None, columns='name', values=['val_1','val_2'])

     val_1      val_2
name     a    b     a    b
0      1.0  NaN   2.0  NaN
1      NaN  4.0   NaN  4.0

In [30]:
# Solution: the index column will not be transposed. 
df.set_index('name').transpose().unstack().to_frame().T

name     a           b
     val_1 val_2 val_1 val_2
0        1     2     4     4

#### Question 2

Desired

```
IndividualID Trip1  Trip2  Trip3  Trip4  Trip5  Trip6  Trip7  Trip8  Trip9 Chains
200100001     23     1      2      4      4      1     5       5     5      9
200100002     21     1      12     3      1      55    7       7            8
200100003     12     3      3      6      3                                 5
200100004     4                                                             1
200100005     6      5      3      9      3      5     6                    7
200100005     23     4      4      2      4      3     6       5            8


```

In [50]:
df = pd.DataFrame({'ID':[1,2,3],'Trip1':[3,4,6],'Trip2':[2,None,3],'Trip3':[3,None,6]})
df

   ID  Trip1  Trip2  Trip3
0   1      3    2.0    3.0
1   2      4    NaN    NaN
2   3      6    3.0    6.0

In [51]:
# Solution: WY
df['Chains'] = (df.shape[1] - 1 - df.iloc[:,1:].isnull().sum(axis=1)).values
df

   ID  Trip1  Trip2  Trip3  Chains
0   1      3    2.0    3.0       3
1   2      4    NaN    NaN       1
2   3      6    3.0    6.0       3

In [ ]:
# Solution 2
df['Chains'] = df.notnull().sum(axis=1) - 1